Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: འཆི་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། འཆི་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། འཆི་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of death, the knowledge of cessation as related to knowledge of death, and the knowledge of the path that leads to cessation as related to knowledge of death.

source: སྐྱེ་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of birth.

source: སྐྱེ་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། སྐྱེ་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། སྐྱེ་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of birth, the knowledge of cessation as related to knowledge of birth, and the knowledge of the path that leads to cessation as related to knowledge of birth.

source: འདོད་པའི་ཟག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the defilement of desire.

source: འདོད་པའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། འདོད་པའི་ཟག་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། འདོད་པའི་ཟག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the defilement of desire, the knowledge of cessation as related to knowledge of the defilement of desire, and the knowledge of the path that leads to cessation as related to knowledge of the defilement of desire.

source: སྲིད་པའི་ཟག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the defilement of existence.

source: སྲིད་པའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། སྲིད་པའི་ཟག་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། སྲིད་པའི་ཟག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the defilement of existence, the knowledge of cessation as related to knowledge of the defilement of existence, and the knowledge of the path that leads to cessation as related to knowledge of the defilement of existence.

source: ལྟ་བའི་ཟག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the defilement of views.

source: ལྟ་བའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ལྟ་བའི་ཟག་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ལྟ་བའི་ཟག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the defilement of views, the knowledge of cessation as related to knowledge of the defilement of views, and the knowledge of the path that leads to cessation as related to knowledge of the defilement of views.

source: མ་རིག་པའི་ཟག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the defilement of ignorance.

source: མ་རིག་པའི་ཟག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། མ་རིག་པའི་ཟག་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། མ་རིག་པའི་ཟག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the defilement of ignorance, the knowledge of cessation as related to knowledge of the defilement of ignorance, and the knowledge of the path that leads to cessation as related to knowledge of the defilement of ignorance.

source: ཟད་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of exhaustion.

source: ཟད་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ཟད་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ཟད་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of exhaustion, the knowledge of cessation as related to knowledge of exhaustion, and the knowledge of the path that leads to cessation as related to knowledge of exhaustion.

source: མི་སྐྱེ་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of no-birth.

source: མི་སྐྱེ་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། མི་སྐྱེ་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། མི་སྐྱེ་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of no-birth, the knowledge of cessation as related to knowledge of no-birth, and the knowledge of the path that leads to cessation as related to knowledge of no-birth.

source: མི་འཇིགས་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of fearlessness.

source: མི་འཇིགས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། མི་འཇིགས་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། མི་འཇིགས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of fearlessness, the knowledge of cessation as related to knowledge of fearlessness, and the knowledge of the path that leads to cessation as related to knowledge of fearlessness.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the correct understandings.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the correct understandings, the knowledge of cessation as related to knowledge of the correct understandings, and the knowledge of the path that leads to cessation as related to knowledge of the correct understandings.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the powers of the Thus-Gone One.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the powers of the Thus-Gone One, the knowledge of cessation as related to knowledge of the powers of the Thus-Gone One, and the knowledge of the path that leads to cessation as related to knowledge of the powers of the Thus-Gone One.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་མཚན་ཉིད་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the characteristics of the Thus-Gone One’s wisdom.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་མཚན་ཉིད་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་མཚན་ཉིད་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་མཚན་ཉིད་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the characteristics of the Thus-Gone One’s wisdom, the knowledge of cessation as related to knowledge of the characteristics of the Thus-Gone One’s wisdom, and the knowledge of the path that leads to cessation as related to knowledge of the characteristics of the Thus-Gone One’s wisdom.

source: དེ་བཞིན་གཤེགས་པའི་གནས་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the abodes of the Thus-Gone One.

source: དེ་བཞིན་གཤེགས་པའི་གནས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་གནས་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་གནས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the abodes of the Thus-Gone One, the knowledge of cessation as related to knowledge of the abodes of the Thus-Gone One, and the knowledge of the path that leads to cessation as related to knowledge of the abodes of the Thus-Gone One.

source: དེ་བཞིན་གཤེགས་པའི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the Thus-Gone One’s faculties.

source: དེ་བཞིན་གཤེགས་པའི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the Thus-Gone One’s faculties, the knowledge of cessation as related to knowledge of the Thus-Gone One’s faculties, and the knowledge of the path that leads to cessation as related to knowledge of the Thus-Gone One’s faculties.

source: ལུས་ཀྱི་ལས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of physical actions.

source: ལུས་ཀྱི་ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ལུས་ཀྱི་ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ལུས་ཀྱི་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of physical actions, the knowledge of cessation as related to knowledge of physical actions, and the knowledge of the path that leads to cessation as related to knowledge of physical actions.

source: ངག་གི་ལས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of verbal actions.

source: ངག་གི་ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ངག་གི་ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ངག་གི་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of verbal actions, the knowledge of cessation as related to knowledge of verbal actions, and the knowledge of the path that leads to cessation as related to knowledge of verbal actions.

source: ཡིད་ཀྱི་ལས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of mental actions.

source: ཡིད་ཀྱི་ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ཡིད་ཀྱི་ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ཡིད་ཀྱི་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of mental actions, the knowledge of cessation as related to knowledge of mental actions, and the knowledge of the path that leads to cessation as related to knowledge of mental actions.

source: སྔོན་དུ་འགྲོ་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the preceding.

source: སྔོན་དུ་འགྲོ་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། སྔོན་དུ་འགྲོ་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། སྔོན་དུ་འགྲོ་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the preceding, the knowledge of cessation as related to knowledge of the preceding, and the knowledge of the path that leads to cessation as related to knowledge of the preceding.

source: རྗེས་སུ་འབྲང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the subsequent.

source: རྗེས་སུ་འབྲང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། རྗེས་སུ་འབྲང་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། རྗེས་སུ་འབྲང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the subsequent, the knowledge of cessation as related to knowledge of the subsequent, and the knowledge of the path that leads to cessation as related to knowledge of the subsequent.

source: རྗེས་སུ་ཉམ་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of decay.

source: རྗེས་སུ་ཉམ་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། རྗེས་སུ་ཉམ་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of decay, the knowledge of cessation as related to knowledge of decay, and the knowledge of the path that leads to cessation as related to knowledge of decay.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of omniscience.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of omniscience, the knowledge of cessation as related to knowledge of omniscience, and the knowledge of the path that leads to cessation as related to knowledge of omniscience.

source: ཁྱིམ་བདག་དེ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཡེ་ཤེས་རྒྱས་པ་བསྟན་པ་དང་པོ་སྟེ།
en: “Householder, that is the first teaching on the Blessed One’s extensive wisdom.

source: དེའི་བཤད་པ་ཉོན་ཅིག །
en: Now listen as I explain this.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of what is possible.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, this is how the Thus-Gone One knows it.

source: ལུས་ཀྱིས་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པ་མི་འདོད་པ། མི་སྡུག་པ་ཡིད་དུ་མི་འོང་བ་འགྲུབ་པ་གང་ཡིན་པ་དེ་ནི་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is possible and feasible that the ripening of negative physical actions is undesirable, repulsive, and unpleasant.

source: ངག་གིས་ཉེས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པ་མི་འདོད་པ། མི་སྡུག་པ་ཡིད་དུ་མི་འོང་བ་འགྲུབ་པ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that the ripening of negative verbal actions and negative mental actions is undesirable, repulsive, and unpleasant.

source: ལུས་ཀྱིས་ཉེས་པར་སྤྱད་པས་ལུས་ཞིག་ནས་ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་བ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that by committing negative physical acts, after the body decays and one dies, one will fall into the sad destinies of the lower realms and take birth in the hells.

source: ངག་གིས་ཉེས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པས་ལུས་ཞིག་ནས་ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་བ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that when negative verbal acts and negative mental acts ripen, after the body decays and one dies, one will fall into the sad destinies of the lower realms and take birth in the hells.

source: ལུས་ཀྱིས་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པ་འདོད་པ། སྡུག་པ་ཡིད་དུ་འོང་བ་འགྲུབ་པ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that the ripening of positive physical actions is desirable, beautiful, and pleasant.

source: ངག་གིས་ལེགས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པ་འདོད་པ། སྡུག་པ་ཡིད་དུ་འོང་བ་མངོན་པར་འགྲུབ་པ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that the ripening of positive verbal actions and positive mental actions creates something desirable, beautiful, and pleasant.

source: ལུས་ཀྱིས་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པས། ལུས་ཞིག་ནས་ཤི་བའི་འོག་ཏུ་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར་བ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that by committing positive physical acts, after the body disintegrates and one dies, one will take birth into the joyful destinies of the higher realms.

source: ངག་གིས་ལེགས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པས་ལུས་ཞིག་ནས་ཤི་བའི་འོག་ཏུ་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར་བ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that by committing positive verbal acts and positive mental acts, after the body disintegrates and one dies, one will take birth into the joyful destinies of the higher realms.

source: འདི་ན་སོ་སོའི་སྐྱེ་བོ་ལ་ལས་བསམས་བཞིན་དུ་མ་སྲོག་དང་ཕྲལ་བ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that some people willingly end the life of their mother.

source: འདི་ན་སོ་སོའི་སྐྱེ་བོ་ལ་ལས་བསམས་བཞིན་དུ་ཕ་སྲོག་དང་ཕྲལ་བ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that some people willingly end the life of their father.

source: འདི་ན་སོ་སོའི་སྐྱེ་བོ་ལ་ལས་བསམས་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་དགྲ་བཅོམ་པ་སྲོག་དང་ཕྲལ་བ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that some people willingly end the life of the worthy hearers of the Thus-Gone One.

source: འདི་ན་སོ་སོའི་སྐྱེ་བོ་ལ་ལས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་འཐུན་པ་ཕྱེ་བ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that some people cause a schism in the community of the hearers.

source: འདི་ན་སོ་སོའི་སྐྱེ་བོ་ལ་ལས་དེ་བཞིན་གཤེགས་པ་ལ་ངན་སེམས་ཀྱིས་ཁྲག་ཕྱུང་བ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that some people with evil intentions draw blood from the body of the Thus-Gone One.

source: འདི་ན་སོ་སོའི་སྐྱེ་བོ་ལ་ལས་སྟོན་པ་གཞན་གྱིས་བསྟན་པ་དང་། འདི་ལས་ཕྱི་རོལ་པ་གཞན་གྱི་ཡང་དག་པའི་ལྟ་བ་འཆའ་ཞིང་བཅས་པ་དང་། སྦྱངས་པ་གཞན་ཡང་དག་པར་ལེན་དུ་འཇུག་པ་དང་།
en: some common people adopt the views of extremists as taught by non-Buddhist teachers and engage in their practices.

source: དགེ་སྦྱོང་དང་བྲམ་ཟེ་གང་ཡང་རུང་བ་ལ་ལ་དག་གི་དགེ་མཚན་དང་། བཀྲ་ཤིས་མང་པོ་སོ་སོའི་བདེན་པ་དེ་དག་གིས་དག་པ་ཡོངས་སུ་ཚོལ་བ་དང་།
en: In this way, seeking purification, they apply themselves to this training because of perceiving many benefits and auspicious qualities in such religious practitioners and brahmins.

source: དགེ་སྦྱོང་དང་བྲམ་ཟེ་གཞན་དག་གིས་བཤད་པ་ལ་ཕྱོགས་ཤིང་། ཚེ་དང་ལྡན་པ་ཤེས་པར་བྱ་བ་འདི་ནི་ཤེས་པར་བྱ།
en: Then, having turned to what those ascetics and brahmins have taught, they say to others, ‘You must meet this venerable teacher!

source: བལྟ་བར་བྱ་བ་འདི་ནི་མཐོང་བར་བྱ་བ་
en: You have to understand this view!’

source: གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that

source: འདི་ན་སོ་སོའི་སྐྱེ་བོ་ལ་ལ་མིའི་སྲིད་པ་བརྒྱད་མངོན་པར་འགྲུབ་པ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that some people obtain the eight human existences.

source: འདི་ན་སྐྱེས་བུ་གང་ཟག་ལ་ལ་ཚངས་པ་ཉིད་སྒྲུབ་པའམ། བདུད་དམ་བྲམ་ཟེ་བསྒྲུབ་པ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that a man can become Brahmā, Māra, or a brahmin.

source: འདི་ན་སྐྱེས་བུ་གང་ཟག་ལ་ལ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་བ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that a man can become a universal monarch.

source: འདི་ན་སྐྱེས་བུ་གང་ཟག་ལ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་བ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that a man can become a thus-gone, worthy, perfect buddha.

source: འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་གཅིག་བྱུང་བ་གང་ཡིན་པ་ཡང་གནས་ཡིན་ཞིང་སྐབས་ཡིན་ནོ། །
en: It is also possible and feasible that only one thus-gone one appears within a single world.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of what is possible.

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་གནས་ཐོབ་པའི་གང་ཟག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, moreover, the Thus-Gone One correctly understands the knowledge of the state of all beings.

source: གང་ཟག་འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་སྣོད་ཡིན་ནོ། །
en: He knows which person is a vessel for the teachings of the buddhas,

source: གང་ཟག་འདི་ནི་རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་སྣོད་ཡིན་ནོ། །
en: which person is a vessel for the teachings of the solitary buddhas,

source: གང་ཟག་འདི་ནི་ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་ཀྱི་སྣོད་ཡིན་ནོ། །
en: and which person is a vessel for the teachings of the hearers.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གནས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, in this way, the Thus-Gone One correctly understands the knowledge of what is possible.

source: དེ་བཞིན་གཤེགས་པ་གནས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན་བསྐལ་པར་ལན་གསུང་སྟེ།
en: When the Thus-Gone One is asked about the knowledge of what is possible, he can respond for an eon.

source: བསྐལ་པ་བརྒྱའམ། བསྐལ་པ་སྟོང་ངམ། བསྐལ་པ་འབུམ་འམ། བསྐལ་པ་བྱེ་བ་འམ། བསྐལ་པ་ས་ཡ་འམ་བསྐལ་པ་གཏམས་སམ། བསྐལ་པ་དཀྲིགས་སམ། བསྐལ་པའི་བར་རམ། བསྐལ་པ་དཔག་ཏུ་མེད་པར་ལན་གསུང་ངོ་། །
en: He can respond for one hundred eons, or one thousand eons, or one hundred thousand eons, or one million eons, or ten million eons, or a quadrillion eons, or one hundred quadrillion eons, or an immeasurable number of eons.

source: བསྐལ་པ་གྲངས་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གཞལ་དུ་མེད་པ་དང་། དཔག་ཏུ་མེད་པ་དང་། བརྗོད་ཀྱིས་མི་ལང་བར་ལན་གསུང་ངོ་། །
en: He can reply for innumerable , inconceivable, incomparable, immeasurable, and inexpressible eons.

source: བསྐལ་པ་དཔག་ཏུ་མེད་པའི་ཡང་དཔག་ཏུ་མེད་པ་དང་། གྲངས་མེད་པའི་དཔག་ཏུ་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དཔག་ཏུ་མེད་པ་དང་། གཞལ་དུ་མེད་པའི་དཔག་ཏུ་མེད་པ་དང་། གཞལ་གྱིས་མི་ལང་བའི་དཔག་ཏུ་མེད་པ་དང་། བརྗོད་དུ་མེད་པའི་དཔག་ཏུ་མེད་པའི་བསྐལ་པར་ལན་གསུང་ངོ་། །
en: He can reply for an immeasurable number of immeasurable eons, and an immeasurable number of innumerable eons, and an immeasurable number of inconceivable eons, and an immeasurable number of incomparable eons, and an immeasurable number of inestimable eons, and an immeasurable number of inexpressible eons.

source: བསྐལ་པ་གྲངས་མེད་པའི་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་པའི་དཔག་ཏུ་མེད་པ་དང་། གྲངས་མེད་པའི་གྲངས་མེད་པ་དང་། གྲངས་མེད་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གྲངས་མེད་པའི་གཞལ་དུ་མེད་པ་དང་། གྲངས་མེད་པའི་གཞལ་གྱིས་མི་ལང་བ་དང་། གྲངས་མེད་པའི་བརྗོད་དུ་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དཔག་ཏུ་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་གྲངས་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་ཅིང་། བསམ་གྱིས་མི་ཁྱབ་པའི་གཞལ་དུ་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་གཞལ་གྱིས་མི་ལང་བ་དང་། གཞལ་དུ་མེད་པའི་དཔག་ཏུ་མེད་པ་དང་། གཞལ་དུ་མེད་པའི་གྲངས་མེད་པ་དང་། གཞལ་དུ་མེད་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གཞལ་དུ་མེད་པའི་གཞལ་དུ་མེད་པ་དང་། གཞལ་དུ་མེད་པའི་གཞལ་གྱིས་མི་ལང་བ་དང་། གཞལ་དུ་མེད་པའི་བརྗོད་དུ་མེད་པ་དང་། གཞལ་གྱིས་མི་ལང་བའི་དཔག་ཏུ་མེད་པ་དང་། གཞལ་གྱིས་མི་ལང་བའི་གྲངས་མེད་པ་དང་། གཞལ་གྱིས་མི་ལང་བའི་བསམ་དུ་མེད་པ་དང་། གཞལ་གྱིས་མི་ལང་བའི་གཞལ་གྱིས་མི་ལང་བ་དང་། གཞལ་གྱིས་མི་ལང་བའི་བརྗོད་དུ་མེད་པ་དང་། གྲངས་མེད་པའི་བརྗོད་དུ་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་བརྗོད་དུ་མེད་པ་དང་། གཞལ་དུ་མེད་པའི་བརྗོད་དུ་མེད་པ་དང་། གཞལ་གྱིས་མི་ལང་བའི་བརྗོད་དུ་མེད་པའི་བརྗོད་དུ་མེད་པར་ལན་གསུང་སྟེ
en: He can respond for an immeasurable number of innumerable eons, and an innumerable number of innumerable eons, and an inconceivable number of innumerable eons, and an incomparable number of innumerable eons, and an inestimable number of innumerable eons, and an inexpressible number of innumerable eons; and an immeasurable number of inconceivable eons, and an innumerable and inconceivable number of inconceivable eons, and an incomparable number of inconceivable eons, and an inestimable number of inconceivable eons; and an immeasurable number of incomparable eons, and an innumerable number of incomparable eons, and an inconceivable number of incomparable eons, and an incomparable number of incomparable eons, and an inestimable number of incomparable eons, and an inexpressible number of incomparable eons, and an immeasurable number of incomparable eons; and an innumerable number of inestimable eons, and an inconceivable number of inestimable eons, and an inestimable number of inestimable eons, and an inexpressible number of inestimable eons; and an inexpressible number of innumerable eons, and an inexpressible number of inconceivable eons, an inexpressible number of incomparable eons, and an inexpressible number of inexpressible and inestimable eons.

source: དེའི་སྤོབས་པ་ཟད་མི་ཤེས་སོ། །
en: Thus, his eloquence is inexhaustible.

source: ཁྱིམ་བདག་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Householder, you may wonder why that is.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་དབྱིངས་བླ་ན་མེད་པ། མཁྱེན་རབ་ཀྱིས་ཤིན་ཏུ་ཐུགས་སུ་ཆུད་དེ།
en: It is because in his wisdom the Thus-Gone One knows the matchless sphere of reality and thus
